logs/16threads/dsb-result_node5_threads16_conn16_compose-post_network_socfb-Reed98-mode-numa-membind-0.log

CONFIG: node:5 threads:16 conn:16 workload:compose-post network:socfb-Reed98 RPS:5000 numa-config:numa-membind-0
*************************************************************
Running 2m test @ http://localhost:8080/wrk2-api/post/compose
  16 threads and 16 connections

  Thread calibration: mean lat.: 3481.116ms, rate sampling interval: 11075ms
  Thread calibration: mean lat.: 3599.850ms, rate sampling interval: 11223ms
  Thread calibration: mean lat.: 3462.611ms, rate sampling interval: 10436ms
  Thread calibration: mean lat.: 3656.380ms, rate sampling interval: 10993ms
  Thread calibration: mean lat.: 3614.749ms, rate sampling interval: 11124ms
  Thread calibration: mean lat.: 3569.123ms, rate sampling interval: 10526ms
  Thread calibration: mean lat.: 3637.914ms, rate sampling interval: 11386ms
  Thread calibration: mean lat.: 3514.201ms, rate sampling interval: 10559ms
  Thread calibration: mean lat.: 3717.027ms, rate sampling interval: 11231ms
  Thread calibration: mean lat.: 3469.822ms, rate sampling interval: 10493ms
  Thread calibration: mean lat.: 3435.106ms, rate sampling interval: 10829ms
  Thread calibration: mean lat.: 3522.221ms, rate sampling interval: 11083ms
  Thread calibration: mean lat.: 3472.746ms, rate sampling interval: 10477ms
  Thread calibration: mean lat.: 3405.642ms, rate sampling interval: 10248ms
  Thread calibration: mean lat.: 3827.236ms, rate sampling interval: 11698ms
  Thread calibration: mean lat.: 3735.730ms, rate sampling interval: 11616ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    34.45s    16.58s    1.06m    58.66%
    Req/Sec   149.18     10.30   178.00     86.18%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.60s 
 75.000%   48.56s 
 90.000%    0.96m 
 99.000%    1.06m 
 99.900%    1.08m 
 99.990%    1.09m 
 99.999%    1.09m 
100.000%    1.09m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5554.175     0.000000            1         1.00
   11501.567     0.100000        26294         1.11
   17268.735     0.200000        52611         1.25
   23035.903     0.300000        78869         1.43
   28803.071     0.400000       105159         1.67
   34603.007     0.500000       131532         2.00
   37355.519     0.550000       144662         2.22
   40075.263     0.600000       157683         2.50
   42926.079     0.650000       170850         2.86
   45744.127     0.700000       184022         3.33
   48562.175     0.750000       197164         4.00
   49872.895     0.775000       203664         4.44
   51216.383     0.800000       210279         5.00
   52756.479     0.825000       216924         5.71
   54263.807     0.850000       223493         6.67
   55771.135     0.875000       230012         8.00
   56590.335     0.887500       233329         8.89
   57409.535     0.900000       236624        10.00
   58195.967     0.912500       239798        11.43
   59080.703     0.925000       243138        13.33
   59998.207     0.937500       246436        16.00
   60424.191     0.943750       248093        17.78
   60850.175     0.950000       249673        20.00
   61243.391     0.956250       251285        22.86
   61669.375     0.962500       253041        26.67
   62095.359     0.968750       254657        32.00
   62324.735     0.971875       255446        35.56
   62554.111     0.975000       256256        40.00
   62783.487     0.978125       257143        45.71
   62980.095     0.981250       257867        53.33
   63242.239     0.984375       258764        64.00
   63373.311     0.985938       259124        71.11
   63537.151     0.987500       259572        80.00
   63668.223     0.989062       259931        91.43
   63799.295     0.990625       260322       106.67
   63963.135     0.992188       260830       128.00
   64028.671     0.992969       261004       142.22
   64094.207     0.993750       261181       160.00
   64192.511     0.994531       261418       182.86
   64258.047     0.995313       261580       213.33
   64356.351     0.996094       261794       256.00
   64389.119     0.996484       261863       284.44
   64454.655     0.996875       262002       320.00
   64487.423     0.997266       262079       365.71
   64552.959     0.997656       262205       426.67
   64618.495     0.998047       262313       512.00
   64651.263     0.998242       262366       568.89
   64684.031     0.998437       262428       640.00
   64684.031     0.998633       262428       731.43
   64716.799     0.998828       262477       853.33
   64749.567     0.999023       262530      1024.00
   64782.335     0.999121       262556      1137.78
   64815.103     0.999219       262583      1280.00
   64847.871     0.999316       262615      1462.86
   64880.639     0.999414       262639      1706.67
   64913.407     0.999512       262660      2048.00
   64946.175     0.999561       262677      2275.56
   64978.943     0.999609       262692      2560.00
   64978.943     0.999658       262692      2925.71
   65044.479     0.999707       262707      3413.33
   65110.015     0.999756       262719      4096.00
   65142.783     0.999780       262724      4551.11
   65175.551     0.999805       262740      5120.00
   65175.551     0.999829       262740      5851.43
   65208.319     0.999854       262753      6826.67
   65208.319     0.999878       262753      8192.00
   65208.319     0.999890       262753      9102.22
   65241.087     0.999902       262759     10240.00
   65241.087     0.999915       262759     11702.86
   65273.855     0.999927       262765     13653.33
   65273.855     0.999939       262765     16384.00
   65306.623     0.999945       262772     18204.44
   65306.623     0.999951       262772     20480.00
   65306.623     0.999957       262772     23405.71
   65306.623     0.999963       262772     27306.67
   65306.623     0.999969       262772     32768.00
   65339.391     0.999973       262778     36408.89
   65339.391     0.999976       262778     40960.00
   65339.391     0.999979       262778     46811.43
   65339.391     0.999982       262778     54613.33
   65339.391     0.999985       262778     65536.00
   65339.391     0.999986       262778     72817.78
   65339.391     0.999988       262778     81920.00
   65339.391     0.999989       262778     93622.86
   65339.391     0.999991       262778    109226.67
   65339.391     0.999992       262778    131072.00
   65372.159     0.999993       262780    145635.56
   65372.159     1.000000       262780          inf
#[Mean    =    34453.690, StdDeviation   =    16584.599]
#[Max     =    65339.392, Total count    =       262780]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  283178 requests in 2.00m, 58.06MB read
  Socket errors: connect 0, read 0, write 0, timeout 300
Requests/sec:   2359.90  
Transfer/sec:    495.49KB
*************************************************************